#include "TestEasyFixed.h"
#include "CryptoTestEasy.h"


void test1() {
    std::string answer;
    while (true) {
        std::cout << "\n=== Задача 1 (фиксированная): Шифр замены ===\n";
        std::cout << "Алфавит: А = (21,40,10) Б = (37,26,03) В = (14,63,71) Г = (22,47,82)\n";
        std::cout << "Д = (01,31,15) Е = (24,83,70) Ё = (99,98,93) Ж = (62,88,11)\n";
        std::cout << "З = (73,30,55) И = (46,02,90) Й = (89,78,79) К = (23,91,69)\n";
        std::cout << "Л = (12,72,38) М = (08,32,61) Н = (27,77,54) О = (53,68,09)\n";
        std::cout << "П = (35,60,84) Р = (04,44,45) С = (20,52,89) Т = (13,39,67)\n";
        std::cout << "У = (59,07,93) Ф = (25,49,76) Х = (75,33,18) Ц = (43,85,51)\n";
        std::cout << "Ч = (19,58,87) Ш = (29,80,66) Щ = (06,50,81) Ъ = (65,34,92)\n";
        std::cout << "Ы = (74,17,42) Ь = (48,56,79) Э = (36,78,86) Ю = (28,64,05) Я = (16,41,57)\n";
        std::cout << "\nДан ключ: 40,30,54,10,23,09,61,52,71,02,01,40,32,90,29,46,76,44,53,14\n";
        std::cout << "Ваша задача понять смысл шифра и ввести ответ (или 'exit'): ";
        Getline(answer);
        if (answer == "exit" || answer == "Exit") {
            std::cout << "Выход из теста.\n";
            return;
        }
        if (answer == "Я ЗНАКОМ С ВИДАМИ ШИФРОВ" || answer == "я знаком с видами шифров") {
            std::cout << "Правильно!\n";
            return;
        }
        else Err(1000);
    }
}

void test2() {
    std::string answer;
    while (true) {
        std::cout << "\n=== Задача 2 (фиксированная): Шифр Цезаря сдвиг 4 ===\n";
        std::cout << "Ключ: Программирование\n";
        std::cout << "Алфавит: А=1,Б=2,В=3,Г=4,Д=5,Е=6,Ё=7,Ж=8,З=9,И=10,Й=11,К=12,\n";
        std::cout << "Л=13,М=14,Н=15,О=16,П=17,Р=18,С=19,Т=20,У=21,Ф=22,Х=23,Ц=24,\n";
        std::cout << "Ч=25,Ш=26,Щ=27,Ъ=28,Ы=29,Ь=30,Э=31,Ю=32,Я=33\n";
        std::cout << "\nВведите зашифрованное слово (или 'exit'): ";
        Getline(answer);
        if (answer == "exit" || answer == "Exit") {
            std::cout << "Выход из теста.\n";
            return;
        }
        if (answer == "УФТЖФДРРМФТЁДСМИ" || answer == "уфтжфдррмфтёдсми") {
            std::cout << "Правильно!\n";
            return;
        }
        else Err(1000);
    }
}

void test3() {
    std::string answer;
    while (true) {
        std::cout << "\n=== Задача 3 (фиксированная): Дешифровка Цезаря сдвиг 6 ===\n";
        std::cout << "Шифр: ЁСИФЦОШТБ\n";
        std::cout << "Алфавит: А=1,Б=2,В=3,Г=4,Д=5,Е=6,Ё=7,Ж=8,З=9,И=10,Й=11,К=12,\n";
        std::cout << "Л=13,М=14,Н=15,О=16,П=17,Р=18,С=19,Т=20,У=21,Ф=22,Х=23,Ц=24,\n";
        std::cout << "Ч=25,Ш=26,Щ=27,Ъ=28,Ы=29,Ь=30,Э=31,Ю=32,Я=33\n";
        std::cout << "\nВведите расшифрованное слово (или 'exit'): ";
        Getline(answer);
        if (answer == "exit" || answer == "Exit") {
            std::cout << "Выход из теста.\n";
            return;
        }
        if (answer == "АЛГОРИТМЫ" || answer == "алгоритмы") {
            std::cout << "Правильно!\n";
            return;
        }
        else Err(1000);
        
    }
}

void test4()
{
    std::string answer;
    while (true)
    {
        std::cout << "\n=== Задача 4 (фиксированная): Перевод чисел из 10-ой системы счисления в 2-ую ===\n";
        std::cout << "Число для перевода: 46\n";
        std::cout << "Пример ответа: 111110\n";
        std::cout << "\nВведите ответ перевода (или 'exit'): ";
        Getline(answer);
        if (answer == "exit" || answer == "Exit") {
            std::cout << "Выход из теста.\n";
            return;
        }
       
        if (answer == "101110") {
            std::cout << "Правильно!\n";
            return;
        }
        else Err(1000);


    }
}

void test5()
{
    std::string answer;
    while (true)
    {
        std::cout << "\n=== Задача 4 (фиксированная): Перевод чисел из 2-ой системы счисления в 16-ую ===\n";
        std::cout << "Число для перевода: 1101110001101\n";
        std::cout << "Пример ответа: 2A2B\n";
        std::cout << "\nВведите ответ перевода (или 'exit'): ";
        Getline(answer);
        if (answer == "exit" || answer == "Exit") {
            std::cout << "Выход из теста.\n";
            return;
        }
        
        if (answer == "1B8D" || answer == "1b8d")
        {
            std::cout << "Правильно!\n";
            return;

        }
        else Err(1000);


    }
}
